Revit 2027 API
IFCAnyHandle.SetAttribute(String, IList<Boolean>) Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAttribute(
	string name,
	IList<bool> values
)
Public Sub SetAttribute (
	name As String,
	values As IList(Of Boolean)
)
public:
void SetAttribute(
	String^ name,
	IList<bool>^ values
)
member SetAttribute :
        name : string *
        values : IList<bool> -> unit
Parameters
name String
values IList<Boolean>
See Also
Reference
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace